#### **Paso 0: Importar librerías**

In [1]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

pd.options.mode.copy_on_write = True

#### **Paso 1: Cargar datos**

In [2]:
df_limpio = pd.read_csv("../data/Clean_Dataset.csv")
df_limpio

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955
...,...,...,...,...,...,...,...,...,...,...,...,...
300148,300148,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,69265
300149,300149,Vistara,UK-826,Chennai,Afternoon,one,Night,Hyderabad,Business,10.42,49,77105
300150,300150,Vistara,UK-832,Chennai,Early_Morning,one,Night,Hyderabad,Business,13.83,49,79099
300151,300151,Vistara,UK-828,Chennai,Early_Morning,one,Evening,Hyderabad,Business,10.00,49,81585
300152,300152,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,81585

In [3]:
df_economy = pd.read_csv("../data/economy.csv")
df_economy.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,11-02-2022,SpiceJet,SG,8709,18:55,Delhi,02h 10m,non-stop,21:05,Mumbai,"5,953"
1,11-02-2022,SpiceJet,SG,8157,06:20,Delhi,02h 20m,non-stop,08:40,Mumbai,"5,953"
2,11-02-2022,AirAsia,I5,764,04:25,Delhi,02h 10m,non-stop,06:35,Mumbai,"5,956"
3,11-02-2022,Vistara,UK,995,10:20,Delhi,02h 15m,non-stop,12:35,Mumbai,"5,955"
4,11-02-2022,Vistara,UK,963,08:50,Delhi,02h 20m,non-stop,11:10,Mumbai,"5,955"

In [4]:
df_economy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206774 entries, 0 to 206773
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   date        206774 non-null  object
 1   airline     206774 non-null  object
 2   ch_code     206774 non-null  object
 3   num_code    206774 non-null  int64
 4   dep_time    206774 non-null  object
 5   from        206774 non-null  object
 6   time_taken  206774 non-null  object
 7   stop        206774 non-null  object
 8   arr_time    206774 non-null  object
 9   to          206774 non-null  object
 10  price       206774 non-null  object
dtypes: int64(1), object(10)
memory usage: 17.4+ MB

In [5]:
df_economy[df_economy.duplicated(keep = False)]

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
516,14-02-2022,Air India,AI,807,17:20,Delhi,15h 15m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,08:35,Mumbai,"12,150"
563,14-02-2022,Air India,AI,807,17:20,Delhi,15h 15m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,08:35,Mumbai,"12,150"
6080,13-03-2022,Air India,AI,475,13:00,Delhi,24h 35m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,13:35,Mumbai,"4,780"
6181,13-03-2022,Air India,AI,475,13:00,Delhi,24h 35m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,13:35,Mumbai,"4,780"

*Hay duplicados*.

In [6]:
df_business =  pd.read_csv("../data/business.csv")
df_business.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612"
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612"
2,11-02-2022,Air India,AI,531,20:00,Delhi,24h 45m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,20:45,Mumbai,"42,220"
3,11-02-2022,Air India,AI,839,21:25,Delhi,26h 30m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,23:55,Mumbai,"44,450"
4,11-02-2022,Air India,AI,544,17:15,Delhi,06h 40m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,23:55,Mumbai,"46,690"

In [7]:
df_business.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93487 entries, 0 to 93486
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        93487 non-null  object
 1   airline     93487 non-null  object
 2   ch_code     93487 non-null  object
 3   num_code    93487 non-null  int64
 4   dep_time    93487 non-null  object
 5   from        93487 non-null  object
 6   time_taken  93487 non-null  object
 7   stop        93487 non-null  object
 8   arr_time    93487 non-null  object
 9   to          93487 non-null  object
 10  price       93487 non-null  object
dtypes: int64(1), object(10)
memory usage: 7.8+ MB

In [8]:
df_business[df_business.duplicated(keep = False)]

Empty DataFrame
Columns: [date, airline, ch_code, num_code, dep_time, from, time_taken, stop, arr_time, to, price]
Index: []

In [9]:
def describe_df(df):
    '''
    Descripción: Para cada columna del dataframe, devuelve el tipo de variable, el
    porcentaje de nulos, los valores únicos y porcentaje de cardinalidad.

    Argumentos:
    df (dataframe)

    Retorna:
    dataframe: dataframe con las columnas del dataframe original, y con las filas
    de los tipos de variables, el tanto por ciento de nulos, los valores únicos
    y el porcentaje de cardinalidad.
    '''

    # Data_type
    data_type = df.dtypes

    # Nulos
    nulos = df.isna().sum()
    porcentaje_nulos = (nulos / len(df) * 100).round(2)

    # Valores únicos
    unicos = df.nunique()

    # Cardinalidad
    card = (unicos / len(df) * 100).round(2)

    # Creación tabla
    tabla = pd.DataFrame({
        "DATA_TYPE": data_type,
        "MISSINGS (%)": porcentaje_nulos,
        "UNIQUE_VALUES": unicos,
        "CARDIN (%)": card
    },
    index = pd.Index(df.columns, name = "COL_N"))

    return tabla.T # devuelve la traspuesta

In [10]:
describe_df(df_economy)

COL_N,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
DATA_TYPE,object,object,object,int64,object,object,object,object,object,object,object
MISSINGS (%),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
UNIQUE_VALUES,49,8,8,1254,251,6,483,37,266,6,9819
CARDIN (%),0.02,0.0,0.0,0.61,0.12,0.0,0.23,0.02,0.13,0.0,4.75

In [11]:
describe_df(df_business)

COL_N,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
DATA_TYPE,object,object,object,int64,object,object,object,object,object,object,object
MISSINGS (%),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
UNIQUE_VALUES,49,2,2,264,166,6,373,25,176,6,2358
CARDIN (%),0.05,0.0,0.0,0.28,0.18,0.01,0.4,0.03,0.19,0.01,2.52

In [12]:
df_economy["date"].unique() == df_business["date"].unique()

array([ True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True])

In [13]:
df_economy["date"].unique()

array(['11-02-2022', '12-02-2022', '13-02-2022', '14-02-2022',
       '15-02-2022', '16-02-2022', '17-02-2022', '18-02-2022',
       '19-02-2022', '20-02-2022', '21-02-2022', '22-02-2022',
       '23-02-2022', '24-02-2022', '25-02-2022', '26-02-2022',
       '27-02-2022', '28-02-2022', '01-03-2022', '02-03-2022',
       '03-03-2022', '04-03-2022', '05-03-2022', '06-03-2022',
       '07-03-2022', '08-03-2022', '09-03-2022', '10-03-2022',
       '11-03-2022', '12-03-2022', '13-03-2022', '14-03-2022',
       '15-03-2022', '16-03-2022', '17-03-2022', '18-03-2022',
       '19-03-2022', '20-03-2022', '21-03-2022', '22-03-2022',
       '23-03-2022', '24-03-2022', '25-03-2022', '26-03-2022',
       '27-03-2022', '28-03-2022', '29-03-2022', '30-03-2022',
       '31-03-2022'], dtype=object)

In [14]:
df_economy["from"].unique()

array(['Delhi', 'Mumbai', 'Bangalore', 'Kolkata', 'Hyderabad', 'Chennai'],
      dtype=object)

In [15]:
df_economy["to"].unique()

array(['Mumbai', 'Bangalore', 'Kolkata', 'Hyderabad', 'Chennai', 'Delhi'],
      dtype=object)

In [16]:
df_business["from"].unique()

array(['Delhi', 'Mumbai', 'Bangalore', 'Kolkata', 'Hyderabad', 'Chennai'],
      dtype=object)

In [17]:
df_business["to"].unique()

array(['Mumbai', 'Bangalore', 'Kolkata', 'Hyderabad', 'Chennai', 'Delhi'],
      dtype=object)

In [18]:
df_economy["ch_code"].unique()

array(['SG', 'I5', 'UK', 'G8', '6E', 'AI', '2T', 'S5'], dtype=object)

In [19]:
df_economy["stop"].unique()

array(['non-stop ',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia IXU\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Chennai\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Indore\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia RPR\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '2+-stop',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Lucknow\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia GOP\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Raipur\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Nagpur\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Surat\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Hyderabad\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia STV\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia IDR\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia VTZ\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Guwahati\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia NAG\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Vishakhapatnam\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia NDC\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia IXE\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Patna\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia PAT\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Mangalore\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Mumbai\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia KLH\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia MYQ\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Kolkata\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Delhi\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Kolhapur\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia JRG\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Bhubaneswar\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Ranchi\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia IXR\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia JGB\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia BBI\r\n\t\t\t\t\t\t\t\t\t\t\t\t',
       '1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\tVia Mysore\r\n\t\t\t\t\t\t\t\t\t\t\t\t'],
      dtype=object)

Primeras observaciones:
- A 'price' hay que quitarles las comas.
- Duplicados en df_economy.
- No hay nulos en ninguno de los dataframes.
- Mismas fechas en ambos dataframes (entre el 11 de Febrero y el 31 de Marzo de 2022).
- 6 ciudades únicas: Mumbai, Bangalore, Kolkata, Hyderabad, Chennai, Delhi.
- 8 compañías economy y 2 business. 
- Hay que limpiar 'stop'.

| Nombre del campo | Descripción                                                                 | Tipo de variable | Notas                  |
|------------------|-----------------------------------------------------------------------------|------------------|------------------------|
| date             | Fecha del vuelo                                                             | object           | Convertir a tipo fecha |
| airline          | Nombre de la compañía aérea                                                 | object           |                        |
| ch_code          | Código del vuelo (tipo de operador del vuelo según nacionalidad)            | object           |                        |
| num_code         | Número de vuelo                                                             | Numérica         |                        |
| dep_time         | Hora de salida                                                              | object           | Convertir a tipo fecha o simplificar en categorías |
| from             | Ciudad de embarque                                                          | object           | 6 ciudades únicas      |
| time_taken       | Duración del vuelo                                                          | object           | Convertir a tipo fecha o numérica (total minutos) |
| stop             | Contiene número de escalas y código del aeropuerto o ciudad de escala       | object           | Tranformarla           |
| arr_time         | Hora de llegada                                                             | object           | Convertir a tipo fecha o simplificar en categorías      |
| to               | Ciudad de desembarque                                                       | object           |                        |
| price            | Target. Precio del billete (en rupias)                                      | object           | Corvertir a numérica.      |

Junto df_economy y df_business en un mismo dataframe, pero antes creo una nueva variable class en ambos:

In [20]:
df_economy["class"] = "economy"
df_economy.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class
0,11-02-2022,SpiceJet,SG,8709,18:55,Delhi,02h 10m,non-stop,21:05,Mumbai,"5,953",economy
1,11-02-2022,SpiceJet,SG,8157,06:20,Delhi,02h 20m,non-stop,08:40,Mumbai,"5,953",economy
2,11-02-2022,AirAsia,I5,764,04:25,Delhi,02h 10m,non-stop,06:35,Mumbai,"5,956",economy
3,11-02-2022,Vistara,UK,995,10:20,Delhi,02h 15m,non-stop,12:35,Mumbai,"5,955",economy
4,11-02-2022,Vistara,UK,963,08:50,Delhi,02h 20m,non-stop,11:10,Mumbai,"5,955",economy

In [21]:
df_business["class"] = "business"
df_business.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612",business
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612",business
2,11-02-2022,Air India,AI,531,20:00,Delhi,24h 45m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,20:45,Mumbai,"42,220",business
3,11-02-2022,Air India,AI,839,21:25,Delhi,26h 30m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,23:55,Mumbai,"44,450",business
4,11-02-2022,Air India,AI,544,17:15,Delhi,06h 40m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,23:55,Mumbai,"46,690",business

In [22]:
df = pd.concat([df_economy, df_business], ignore_index = True)
df

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class
0,11-02-2022,SpiceJet,SG,8709,18:55,Delhi,02h 10m,non-stop,21:05,Mumbai,"5,953",economy
1,11-02-2022,SpiceJet,SG,8157,06:20,Delhi,02h 20m,non-stop,08:40,Mumbai,"5,953",economy
2,11-02-2022,AirAsia,I5,764,04:25,Delhi,02h 10m,non-stop,06:35,Mumbai,"5,956",economy
3,11-02-2022,Vistara,UK,995,10:20,Delhi,02h 15m,non-stop,12:35,Mumbai,"5,955",economy
4,11-02-2022,Vistara,UK,963,08:50,Delhi,02h 20m,non-stop,11:10,Mumbai,"5,955",economy
...,...,...,...,...,...,...,...,...,...,...,...,...
300256,31-03-2022,Vistara,UK,822,09:45,Chennai,10h 05m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,19:50,Hyderabad,"69,265",business
300257,31-03-2022,Vistara,UK,826,12:30,Chennai,10h 25m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,22:55,Hyderabad,"77,105",business
300258,31-03-2022,Vistara,UK,832,07:05,Chennai,13h 50m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,20:55,Hyderabad,"79,099",business
300259,31-03-2022,Vistara,UK,828,07:00,Chennai,10h 00m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,17:00,Hyderabad,"81,585",business
300260,31-03-2022,Vistara,UK,822,09:45,Chennai,10h 05m,1-stop\r\n\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t...,19:50,Hyderabad,"81,585",business

In [23]:
df_copy = df.copy()

#### Estudio de los datos para definir el plan de negocio

Primero convierto 'price':

In [30]:
df["price"] = df["price"].str.replace(",", "").astype(int)

In [ ]:
df.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class
0,11-02-2022,SpiceJet,SG,8709,18:55,Delhi,02h 10m,non-stop,21:05,Mumbai,5953,economy
1,11-02-2022,SpiceJet,SG,8157,06:20,Delhi,02h 20m,non-stop,08:40,Mumbai,5953,economy
2,11-02-2022,AirAsia,I5,764,04:25,Delhi,02h 10m,non-stop,06:35,Mumbai,5956,economy
3,11-02-2022,Vistara,UK,995,10:20,Delhi,02h 15m,non-stop,12:35,Mumbai,5955,economy
4,11-02-2022,Vistara,UK,963,08:50,Delhi,02h 20m,non-stop,11:10,Mumbai,5955,economy

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300261 entries, 0 to 300260
Data columns (total 12 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   date        300261 non-null  object
 1   airline     300261 non-null  object
 2   ch_code     300261 non-null  object
 3   num_code    300261 non-null  int64
 4   dep_time    300261 non-null  object
 5   from        300261 non-null  object
 6   time_taken  300261 non-null  object
 7   stop        300261 non-null  object
 8   arr_time    300261 non-null  object
 9   to          300261 non-null  object
 10  price       300261 non-null  int64
 11  class       300261 non-null  object
dtypes: int64(2), object(10)
memory usage: 27.5+ MB

Vuelos únicos por compañía:

In [ ]:
df["airline"].value_counts()

airline
Vistara      127859
Air India     80894
Indigo        43120
GO FIRST      23177
AirAsia       16098
SpiceJet       9011
StarAir          61
Trujet           41
Name: count, dtype: int64

In [69]:
df_economy["airline"].value_counts()

airline
Vistara      67270
Air India    47996
Indigo       43120
GO FIRST     23177
AirAsia      16098
SpiceJet      9011
StarAir         61
Trujet          41
Name: count, dtype: int64

Distribución de los precios por aerolínea y clase:

In [49]:
df.groupby(["airline", "class"])["price"].describe()

                      count          mean           std      min      25%  \
airline   class
Air India business  32898.0  47131.039212  10521.926556  12000.0  42457.0
          economy   47996.0   7313.730144   3989.516123   1526.0   4556.0
AirAsia   economy   16098.0   4091.072742   2824.055172   1105.0   2361.0
GO FIRST  economy   23177.0   5651.930578   2513.669305   1105.0   4205.0
Indigo    economy   43120.0   5324.216303   3268.894831   1105.0   3219.0
SpiceJet  economy    9011.0   6179.278881   2999.630406   1106.0   4197.0
StarAir   economy      61.0   4932.655738   3487.874935   2000.0   2115.0
Trujet    economy      41.0   3244.634146    305.184596   3124.0   3166.0
Vistara   business  60589.0  55477.027777  13225.349062  17604.0  49207.0
          economy   67270.0   7806.943645   3854.572559   1714.0   5206.0

                        50%      75%       max
airline   class
Air India business  49613.0  54608.0   90970.0
          economy    6082.0   9135.0   42349.0
AirAsia   economy    3276.0   4589.0   31917.0
GO FIRST  economy    5336.0   6324.0   32803.0
Indigo    economy    4453.0   6489.0   31952.0
SpiceJet  economy    5654.0   7412.0   34158.0
StarAir   economy    4337.0   8582.0   17482.0
Trujet    economy    3196.0   3196.0    4844.0
Vistara   business  56588.0  62591.0  123071.0
          economy    6461.0   9945.0   37646.0

- Más vuelos de economy que de business tanto en Air India como en Vistara.
- En media es más cara Vistara que Air India, y en particular, más cara que ninguna.
- De la clase economy, los mínimos de StarAir y Trujet son los más altos.
- Poca variabilidad de precios de Trujet, el resto de compañías presentan mucha variabilidad.

#### Estudio de vuelos de una ciudad a otra

In [73]:
pd.set_option('display.max_rows', None)
grupo = df.groupby(['from', 'to', 'airline']).size()
grupo

from       to         airline
Bangalore  Chennai    Air India    1610
                      AirAsia       138
                      GO FIRST      369
                      Indigo        282
                      SpiceJet       58
                      Vistara      3953
           Delhi      Air India    2633
                      AirAsia      1558
                      GO FIRST     1446
                      Indigo       1961
                      SpiceJet      735
                      Vistara      5423
           Hyderabad  Air India    2228
                      AirAsia       192
                      GO FIRST      474
                      Indigo       1318
                      SpiceJet       31
                      StarAir        40
                      Trujet          2
                      Vistara      4686
           Kolkata    Air India    2026
                      AirAsia       848
                      GO FIRST      874
                      Indigo       1637
                      SpiceJet      274
                      Vistara      4370
           Mumbai     Air India    3555
                      AirAsia       628
                      GO FIRST     1338
                      Indigo       1882
                      SpiceJet      157
                      Vistara      5380
Chennai    Bangalore  Air India    1638
                      AirAsia       138
                      GO FIRST      382
                      Indigo        348
                      SpiceJet       55
                      Vistara      3932
           Delhi      Air India    1845
                      AirAsia       707
                      GO FIRST      576
                      Indigo       1747
                      SpiceJet      763
                      Vistara      4145
           Hyderabad  Air India    1432
                      AirAsia       126
                      GO FIRST       38
                      Indigo       1404
                      SpiceJet       51
                      Vistara      3052
           Kolkata    Air India    1869
                      AirAsia       307
                      GO FIRST      172
                      Indigo       1541
                      SpiceJet      145
                      Vistara      2949
           Mumbai     Air India    3128
                      AirAsia       220
                      GO FIRST      121
                      Indigo       1706
                      SpiceJet      205
                      Vistara      3958
Delhi      Bangalore  Air India    3060
                      AirAsia      1549
                      GO FIRST     1489
                      Indigo       1919
                      SpiceJet      616
                      Vistara      5379
           Chennai    Air India    2576
                      AirAsia       704
                      GO FIRST      809
                      Indigo       1789
                      SpiceJet      758
                      Vistara      4144
           Hyderabad  Air India    2883
                      AirAsia       728
                      GO FIRST      497
                      Indigo       1036
                      SpiceJet      152
                      Vistara      4032
           Kolkata    Air India    3537
                      AirAsia       774
                      GO FIRST     1279
                      Indigo       1877
                      SpiceJet      494
                      Vistara      3973
           Mumbai     Air India    5009
                      AirAsia       632
                      GO FIRST     1650
                      Indigo       1656
                      SpiceJet      504
                      Vistara      5840
Hyderabad  Bangalore  Air India    1670
                      AirAsia       322
                      GO FIRST      331
                      Indigo       1159
                      StarAir        21
                      Trujet         23
                      Vistara      4372
           Chennai    Air India    1667
                      AirAsia       148
                      GO FIRST       38
                      Indigo       1436
                      SpiceJet       15
                      Vistara      3091
           Delhi      Air India    2385
                      AirAsia       596
                      GO FIRST      650
                      Indigo       1095
                      SpiceJet      149
                      Vistara      3632
           Kolkata    Air India    2133
                      AirAsia       397
                      GO FIRST      320
                      Indigo       1692
                      SpiceJet      168
                      Vistara      3277
           Mumbai     Air India    3233
                      AirAsia       381
                      GO FIRST     1166
                      Indigo        833
                      Trujet          9
                      Vistara      4451
Kolkata    Bangalore  Air India    1959
                      AirAsia       898
                      GO FIRST      801
                      Indigo       1487
                      SpiceJet      275
                      Vistara      4404
           Chennai    Air India    2096
                      AirAsia       304
                      GO FIRST      123
                      Indigo       1155
                      SpiceJet      175
                      Vistara      2800
           Delhi      Air India    3037
                      AirAsia       827
                      GO FIRST     1154
                      Indigo       1865
                      SpiceJet      441
                      Vistara      3182
           Hyderabad  Air India    2054
                      AirAsia       298
                      GO FIRST      366
                      Indigo       1684
                      SpiceJet      149
                      Vistara      3346
           Mumbai     Air India    3254
                      AirAsia       502
                      GO FIRST     1146
                      Indigo       1105
                      SpiceJet      907
                      Vistara      4553
Mumbai     Bangalore  Air India    3632
                      AirAsia       530
                      GO FIRST     1383
                      Indigo       1859
                      SpiceJet      142
                      Vistara      5339
           Chennai    Air India    3192
                      AirAsia       222
                      GO FIRST      149
                      Indigo       1787
                      SpiceJet      166
                      Vistara      4614
           Delhi      Air India    4650
                      AirAsia       745
                      GO FIRST     1684
                      Indigo       1465
                      SpiceJet      453
                      Vistara      5812
           Hyderabad  Air India    3425
                      AirAsia       216
                      GO FIRST     1202
                      Indigo        705
                      Trujet          7
                      Vistara      4922
           Kolkata    Air India    3478
                      AirAsia       463
                      GO FIRST     1150
                      Indigo       1690
                      SpiceJet      973
                      Vistara      4848
dtype: int64

Ciudades de las que salen más vuelos:

In [74]:
grupo.groupby(level='from').sum().sort_values(ascending = False)

from
Delhi        61345
Mumbai       60903
Bangalore    52106
Kolkata      46347
Hyderabad    40860
Chennai      38700
dtype: int64

Número de vuelos de una ciudad a otra:

In [ ]:
total_routes = grupo.groupby(level=['from', 'to']).sum().sort_values(ascending=False)
print(total_routes.head(10))

from       to
Delhi      Mumbai       15291
Mumbai     Delhi        14809
Delhi      Bangalore    14012
Bangalore  Delhi        13756
           Mumbai       12940
Mumbai     Bangalore    12885
           Kolkata      12602
Delhi      Kolkata      11934
Kolkata    Mumbai       11467
Delhi      Chennai      10780
dtype: int64